{
    "presidents": [
        {
            "no": "1",
            "name": "Dominique Mbonyumutwa",
            "imgsrc": "Dominique-Mbonyumutwa.jpg",
            "from": 1961,
            "to": 1961,
            "reason": "",
            "born": 1921,
            "party": "MDR-Parmehutu",
            "diedInOffice": false,
            "extraInformation": [
                {
                    "bio": "Dominique Mbonyumutwa (January 1921 – 26 July 1986) was a Rwandan politician who served as the interim first President of Rwanda for a period of nine months in 1961, during a transitional phase between the overthrow of the Rwandan monarchy in the Rwandan Revolution and the country's independence.",
                    "moreinfo": "Following an election in October of that year, he was succeeded by Grégoire Kayibanda who became the first elected president of the country following independence."
                }
            ],
            "contributors": [
                {
                    "no": "1",
                    "name": "Musab1258",
                    "github_url": "https://github.com/Musab1258",
                    "extra_url": "https://musab1258.github.io/Personal-Portfolio-Webpage/"
                }
            ]
        },
        {
            "no": "2",
            "name": "Grégoire Kayibanda",
            "imgsrc": "Grégoire-Kayibanda.jpg",
            "from": 1961,
            "to": 1973,
            "reason": "",
            "born": 1924,
            "party": "Parmehutu",
            "diedInOffice": false,
            "extraInformation": [
                {
                    "bio": "Grégoire Kayibanda (May 1, 1924 – December 15, 1976) was a Rwandan politician and revolutionary who was the first elected President of Rwanda from 1962 to 1973. An ethnic Hutu, he was a pioneer of the Rwandan Revolution and led Rwanda's struggle for independence from Belgium, replacing the Tutsi monarchy with a republican form of government.",
                    "moreinfo": "Rwanda became independent from Belgium in 1962, with Kayibanda serving as the country's first president, establishing a pro-Hutu policy and a de facto one-party system governed by his party, Parmehutu. He was overthrown in a coup d'état in 1973 by his defense minister, Juvénal Habyarimana, and died three years later."
                }
            ],
            "contributors": [
                {
                    "no": "1",
                    "name": "Musab1258",
                    "github_url": "https://github.com/Musab1258",
                    "extra_url": "https://musab1258.github.io/Personal-Portfolio-Webpage/"
                }
            ]
        },
        {
            "no": "3",
            "name": "Juvénal Habyarimana",
            "imgsrc": "Juvénal_Habyarimana.jpg",
            "from": 1973,
            "to": 1994,
            "reason": "",
            "born": 1937,
            "party": "Military/MRND",
            "diedInOffice": true,
            "extraInformation": [
                {
                    "bio": "Juvénal Habyarimana(8 March 1937 – 6 April 1994) was a Rwandan politician and military officer who served as the second president of Rwanda, from 1973 until 1994. He was nicknamed 'Kinani', a Kinyarwanda word meaning 'invincible'.",
                    "moreinfo": "An ethnic Hutu, Habyarimana served several security positions including minister of defense under Rwanda's first president, Grégoire Kayibanda. After overthrowing Kayibanda in a coup in 1973, he became the country's new president and eventually continued his predecessor's pro-Hutu policies."
                }
            ],
            "contributors": [
                {
                    "no": "2",
                    "name": "Kehinde-Onifade",
                    "github_url": "https://github.com/kendoriddy",
                    "extra_url": "https://kenny-onifade.netlify.app/"
                }
            ]
        },
        {
            "no": "4",
            "name": "Théodore Sindikubwabo",
            "imgsrc": "Théodore-Sindikubwabo.jpeg",
            "from": 1994,
            "to": 1994,
            "reason": "",
            "born": 1928,
            "party": "Parmehutu",
            "diedInOffice": false,
            "extraInformation": [
                {
                    "bio": "Théodore Sindikubwabo was born in Zivu, Shyanda village in the town of Butare formerly called Astrida in Rwanda-Urundi Territory, and currently the southern province of Rwanda. His parents Zacharrie SEMUTWA and Judithe NYIRAMANDWA were both from Tutsi ethnic group. Sindikubwabo was educated as a physician and was Minister of Health in the administration of President Kayibanda. Following the takeover by Juvénal Habyarimana, Sindikubwabo became a practising pediatrician in Kigali Central Hospital. He later returned to politics as a deputy in parliament.",
                    "moreinfo": "Immediately following Habyarimana's assassination on April 6, 1994, Sindikubwabo was installed as interim President by the Crisis Committee controlled by Colonel Théoneste Bagosora, and he was the head of state during the genocide. Sindikubwabo is widely believed to have been a puppet of the group of military officers who held the real power. On 19 April 1994, he made a now-infamous speech at the ceremony appointing a new Préfet (Governor) of Butare that was broadcast on national radio, in which he insulted those who were not 'working', a euphemism for killing Tutsis, and told them to 'get out of the way and let us work'. On 29 April, he returned to Butare and told the populace that he was there to supervise the killing of Tutsi. On 18 May, whilst on a visit to Kibuye Prefecture, he congratulated the people on how well they had done their 'work'."
                }
            ],
            "contributors": [
                {
                    "no": "1",
                    "name": "Musab1258",
                    "github_url": "https://github.com/Musab1258",
                    "extra_url": "https://musab1258.github.io/Personal-Portfolio-Webpage/"
                }
            ]
        },
        {
            "no": "5",
            "name": "Pasteur Bizimungu",
            "imgsrc": "Pasteur-Bizimungu.jpeg",
            "from": 1994,
            "to": 2000,
            "reason": "",
            "born": 1950,
            "party": "FPR",
            "diedInOffice": false,
            "extraInformation": [
                {
                    "bio": "Pasteur Bizimungu (born April 1950) is a Rwandan politician who served as the third President of Rwanda, holding office from 19 July 1994 until 23 March 2000.",
                    "moreinfo": "A Rwandan, Bizimingu was born in the Gisenyi prefecture of Rwanda. According to the academic Filip Reyntjens, Bizimungu had ties to radical anti-Tutsi groups as a student in the 1970s, but later joined the RPF. He served as President of Rwanda after the 1994 genocide."
                }
            ],
            "contributors": [
                {
                    "no": "1",
                    "name": "Musab1258",
                    "github_url": "https://github.com/Musab1258",
                    "extra_url": "https://musab1258.github.io/Personal-Portfolio-Webpage/"
                }
            ]
        },
        {
            "no": "6",
            "name": "Paul Kagame",
            "imgsrc": "Paul-Kagame.jpg",
            "from": 2000,
            "to": "tilldate",
            "reason": "",
            "born": 1957,
            "party": "FPR",
            "diedInOffice": false,
            "extraInformation": [
                {
                    "bio": " Paul Kagame ( born 23 October 1957) is a Rwandan politician and former military leader. He is the sixth and current president of Rwanda, having taken office in 2000. Kagame previously commanded the Rwandan Patriotic Front (RPF), a Uganda-based rebel force which invaded Rwanda in 1990 and was one of the parties of the conflict during the Rwandan Civil War and the armed force which ended the Rwandan genocide. He was considered Rwanda's de facto leader when he served as Vice President and Minister of Defence under President Pasteur Bizimungu from 1994 to 2000.",
                    "moreinfo": "Kagame was born to a Tutsi family in southern Rwanda. When he was two years old, the Rwandan Revolution ended centuries of Tutsi political dominance; his family fled to Uganda, where he spent the rest of his childhood. In the 1980s, Kagame fought in Yoweri Museveni's rebel army, becoming a senior Ugandan army officer after Museveni's military victories carried him to the Ugandan presidency. Kagame joined the RPF, taking control of the group when previous leader Fred Rwigyema died on the second day of the 1990 invasion. By 1993, the RPF controlled significant territory in Rwanda and a ceasefire was negotiated. The assassination of Rwandan President Juvénal Habyarimana set off the genocide, in which Hutu extremists killed an estimated 500,000 to 800,000 Tutsi and moderate Hutu. Kagame resumed the civil war, and ended the genocide with a military victory."
                }
            ],
            "contributors": [
                {
                    "no": "1",
                    "name": "Musab1258",
                    "github_url": "https://github.com/Musab1258",
                    "extra_url": "https://musab1258.github.io/Personal-Portfolio-Webpage/"
                }
            ]
        },
        {
            "no": "7",
            "name": "name goes here",
            "imgsrc": "placeholder.png",
            "from": 1960,
            "to": 2000,
            "reason": "",
            "born": 1999,
            "party": "Politcal Party",
            "diedInOffice": false,
            "extraInformation": [
                {
                    "bio": "A frontend engineer from Nigeria.",
                    "moreinfo": ""
                }
            ],
            "contributors": [
                {
                    "no": "1",
                    "name": "unclebigbay",
                    "github_url": "https://github.com/unclebay143",
                    "extra_url": "unclebigbay.com"
                }
            ]
        }
    ]
}
